app/controllers/announcements_controller.rb

  def index
    # On demande 10 annonces par page
    @announcements = Announcement.paginate(:page => params[:page], :per_page => 5)
---
SELECT * FROM "announcements" LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "announcements"

  def show
    @announcement = Announcement.find(params[:id])
---
SELECT * FROM "announcements" WHERE ("announcements"."id" = 2)