app/controllers/announcements_controller.rb

  def index
    # On demande 10 annonces par page
    # et que les annonces aient été crées il y a moins de 10 jours
    @announcements = Announcement.find(:all, :conditions=>["created_at > ?", 10.day.ago]).paginate(:page => params[:page], :per_page => 5)
---
SELECT * FROM "announcements" WHERE ("announcements"."id" = 1)